In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('nyc_weather.csv')

In [3]:
data.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 11 columns):
EST                     31 non-null object
Temperature             31 non-null int64
DewPoint                31 non-null int64
Humidity                31 non-null int64
Sea Level PressureIn    31 non-null float64
VisibilityMiles         31 non-null int64
WindSpeedMPH            28 non-null float64
PrecipitationIn         31 non-null object
CloudCover              31 non-null int64
Events                  9 non-null object
WindDirDegrees          31 non-null int64
dtypes: float64(2), int64(6), object(3)
memory usage: 2.8+ KB

In [5]:
data.describe()

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [8]:
numeric_data = data._get_numeric_data()
numeric_data.head(2)

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
0,38,23,52,30.03,10,8.0,5,281
1,36,18,46,30.02,10,7.0,3,275

In [9]:
#featching categorical features
obj_data = data.select_dtypes(include=['object']).copy()
obj_data.head()

        EST PrecipitationIn Events
0  1/1/2016               0    NaN
1  1/2/2016               0    NaN
2  1/3/2016               0    NaN
3  1/4/2016               0    NaN
4  1/5/2016               0    NaN

In [12]:
data['Temperature'].max()

50

In [15]:
data.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [16]:
data['Events'].value_counts()

Rain        4
Snow        3
Fog-Snow    2
Name: Events, dtype: int64

In [18]:
data['EST'][data['Events']=='Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [19]:
data['WindSpeedMPH'].mean()

6.892857142857143

In [20]:
data = pd.read_csv('weather_data.csv')
data.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [25]:
weather_data = [
    ('1/1/2017',32,6,'Rain'),
    ('1/2/2017',35,7,'Sunny'),
    ('1/3/2017',28,2,'snow'),
    ('1/4/2017',24,7,'snow'),
    ('1/5/2017',32,4,'Rain')
]

In [26]:
data = pd.DataFrame(weather_data,columns=['day','temperature','windspeed','event'])
# data = pd.DataFrame(weather_data,columns=['day','temperature','windspeed','event'],index=[1,2,3,4,5])

data

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   snow
3  1/4/2017           24          7   snow
4  1/5/2017           32          4   Rain

In [29]:
data.iloc[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  snow
3  1/4/2017           24          7  snow
4  1/5/2017           32          4  Rain

In [30]:
data['temperature']

0    32
1    35
2    28
3    24
4    32
Name: temperature, dtype: int64

In [32]:
data[['temperature','event']]

   temperature  event
0           32   Rain
1           35  Sunny
2           28   snow
3           24   snow
4           32   Rain

In [34]:
data['temperature'].describe()

count     5.000000
mean     30.200000
std       4.266146
min      24.000000
25%      28.000000
50%      32.000000
75%      32.000000
max      35.000000
Name: temperature, dtype: float64

In [37]:
data[data['temperature'] == data['temperature'].max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [38]:
data['temperature'].max()

35

In [41]:
data['day'][data['temperature'] == data['temperature'].max()]

1    1/2/2017
Name: day, dtype: object

## Group-By

In [42]:
data = pd.read_csv('weather_data_cities.csv')
data.head()

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny

In [50]:
group = data.groupby('city')
print(group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000279B9A3F588>

In [51]:
data['city'].value_counts()

paris       4
new york    4
mumbai      4
Name: city, dtype: int64

In [52]:
for city,cities in group:
    print(city)
    print(cities)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [53]:
data[data['city']=='mumbai']

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [54]:
group.get_group('mumbai')

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [55]:
group.max()  # it will give you maximum values of numerical features

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [56]:
group.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [57]:
group.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [58]:
indian_weather = pd.DataFrame({
    'city' : ['Andhra','Telangana','Banglore'],
    'temperature' : [32,36,30],
    'humidity' : [80,60,70]
})

In [60]:
indian_weather

        city  temperature  humidity
0     Andhra           32        80
1  Telangana           36        60
2   Banglore           30        70

In [61]:
us_weather = pd.DataFrame({
    'city' : ['newyork','chicago','new jersey'],
    'temperature' : [21,14,28],
    'humidity' : [68,65,75]
})

In [62]:
us_weather

         city  temperature  humidity
0     newyork           21        68
1     chicago           14        65
2  new jersey           28        75

In [64]:
data = pd.concat([indian_weather,us_weather],ignore_index=True)
data

         city  temperature  humidity
0      Andhra           32        80
1   Telangana           36        60
2    Banglore           30        70
3     newyork           21        68
4     chicago           14        65
5  new jersey           28        75

In [65]:
data = pd.concat([indian_weather,us_weather],ignore_index=True,axis=1)
data

           0   1   2           3   4   5
0     Andhra  32  80     newyork  21  68
1  Telangana  36  60     chicago  14  65
2   Banglore  30  70  new jersey  28  75

## Merge DataFrames

In [66]:
temperature_df = pd.DataFrame({
    'city' : ['andhra','telangana','banglore','chennai'],
    'temperature' : [32,36,30,40]
})
temperature_df

        city  temperature
0     andhra           32
1  telangana           36
2   banglore           30
3    chennai           40

In [67]:
humidity_df =  pd.DataFrame({
    'city' : ['andhra','telangana','banglore'],
    'humidity' : [68,65,75]
})
humidity_df

        city  humidity
0     andhra        68
1  telangana        65
2   banglore        75

In [72]:
pd.merge(temperature_df,humidity_df,how='outer',on='city')

        city  temperature  humidity
0     andhra           32      68.0
1  telangana           36      65.0
2   banglore           30      75.0
3    chennai           40       NaN

In [73]:
pd.merge(temperature_df,humidity_df,on='city')

        city  temperature  humidity
0     andhra           32        68
1  telangana           36        65
2   banglore           30        75